[
  {
    "reference": "Genesis 3:8-15",
    "minister": "Odedeji B.J",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 8: And they heard the voice of the LORD God walking in the garden in the cool of the day: and Adam and his wife hid themselves from the presence of the LORD God among the trees of the garden.\nVerse 9: And the LORD God called unto Adam, and said unto him, Where art thou?\nVerse 10: And he said, I heard thy voice in the garden, and I was afraid, because I was naked; and I hid myself.\nVerse 11: And he said, Who told thee that thou wast naked? Hast thou eaten of the tree, whereof I commanded thee that thou shouldest not eat?\nVerse 12: And the man said, The woman whom thou gavest to be with me, she gave me of the tree, and I did eat.\nVerse 13: And the LORD God said unto the woman, What is this that thou hast done? And the woman said, The serpent beguiled me, and I ate.\nVerse 14: And the LORD God said unto the serpent, Because thou hast done this, thou art cursed above all cattle, and above every beast of the field; upon thy belly shalt thou go, and dust shalt thou eat all the days of thy life.\nVerse 15: And I will put enmity between thee and the woman, and between thy seed and her seed; it shall bruise thy head, and thou shalt bruise his heel."
      },
      {
        "name": "NIV",
        "text": "Verse 8: Then the man and his wife heard the sound of the LORD God as he was walking in the garden in the cool of the day, and they hid from the LORD God among the trees of the garden.\nVerse 9: But the LORD God called to the man, “Where are you?” \nVerse 10: He answered, “I heard you in the garden, and I was afraid because I was naked; so I hid.” \nVerse 11: And he said, “Who told you that you were naked? Have you eaten from the tree that I commanded you not to eat from?” \nVerse 12: The man said, “The woman you put here with me—she gave me some fruit from the tree, and I ate it.” \nVerse 13: Then the LORD God said to the woman, “What is this you have done?” The woman said, “The serpent deceived me, and I ate.” \nVerse 14: So the LORD God said to the serpent, “Because you have done this, cursed are you above all livestock and all wild animals! You will crawl on your belly and you will eat dust all the days of your life.\nVerse 15: And I will put enmity between you and the woman, and between your offspring and hers; he will crush your head, and you will strike his heel.” "
      },
      {
        "name": "ESV",
        "text":"Verse 8: And they heard the sound of the LORD God walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of the LORD God among the trees of the garden.\nVerse 9: But the LORD God called to the man and said to him, 'Where are you?'\nVerse 10: And he said, 'I heard the sound of you in the garden, and I was afraid, because I was naked, and I hid myself.'\nVerse 11: He said, 'Who told you that you were naked? Have you eaten of the tree of which I commanded you not to eat?'\nVerse 12: The man said, 'The woman whom you gave to be with me, she gave me fruit of the tree, and I ate.'\nVerse 13: Then the LORD God said to the woman, 'What is this that you have done?' The woman said, 'The serpent deceived me, and I ate.'\nVerse 14: The LORD God said to the serpent, 'Because you have done this, cursed are you above all livestock and above all beasts of the field; on your belly you shall go, and dust you shall eat all the days of your life.'\nVerse 15: I will put enmity between you and the woman, and between your offspring and her offspring; he shall bruise your head, and you shall bruise his heel.'"
      }
    ]
  },
  {
    "reference": "Genesis 22:15-18",
    "minister": "Ifeoluwa Odedeji",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 15: And the angel of the LORD called unto Abraham out of heaven the second time, and said, By myself have I sworn, saith the LORD, for because thou hast done this thing, and hast not withheld thy son, thine only son:\nVerse 16: That in blessing I will bless thee, and in multiplying I will multiply thy seed as the stars of the heaven, and as the sand which is upon the sea shore; and thy seed shall possess the gate of his enemies;\nVerse 17: And in thy seed shall all the nations of the earth be blessed; because thou hast obeyed my voice.\nVerse 18: For I have known him, that he will command his children and his household after him, and they shall keep the way of the LORD, to do justice and judgment; that the LORD may bring upon Abraham that which he hath spoken of him."
      },
      {
        "name": "NIV",
        "text":"Verse 15: The angel of the LORD called to Abraham from heaven a second time\nVerse 16: and said, “I swear by myself, declares the LORD, that because you have done this and have not withheld your son, your only son,\nVerse 17: I will surely bless you and make your descendants as numerous as the stars in the sky and as the sand on the seashore. Your descendants will take possession of the cities of their enemies,\nVerse 18: and through your offspring all nations on earth will be blessed, because you have obeyed me.”"
      },
      {
        "name": "ESV",
        "text": "Verse 15: And the angel of the LORD called to Abraham a second time from heaven\nVerse 16: and said, “By myself I have sworn, declares the LORD, because you have done this and have not withheld your son, your only son,\nVerse 17: I will surely bless you, and I will surely multiply your offspring as the stars of heaven and as the sand that is on the seashore. And your offspring shall possess the gate of his enemies,\nVerse 18: and in your offspring shall all the nations of the earth be blessed, because you have obeyed my voice.”"
    }
  ]
},
  {
    "reference": "Isaiah 9:2,6-7",
    "minister": "Odedeji O.A (JP)",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 2: The people that walked in darkness have seen a great light: they that dwell in the land of the shadow of death, upon them hath the light shined.\nVerse 6: For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.\nVerse 7: Of the increase of his government and peace there shall be no end, upon the throne of David, and upon his kingdom, to order it, and to establish it with judgment and with justice from henceforth even for ever. The zeal of the LORD of hosts will perform this."
      },
      {
        "name": "NIV",
        "text": "Verse 2: The people walking in darkness have seen a great light; on those living in the land of deep darkness a light has dawned.\nVerse 6: For to us a child is born, to us a son is given, and the government will be on his shoulders. And he will be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.\nVerse 7: Of the greatness of his government and peace there will be no end. He will reign on David’s throne and over his kingdom, establishing and upholding it with justice and righteousness from that time on and forever. The zeal of the LORD Almighty will accomplish this."
      },
      {
        "name": "ESV",
        "text": "Verse 2\nThe people who walked in darkness have seen a great light; those who dwelt in a land of deep darkness, on them has light shone.\n\nVerse 6\nFor to us a child is born, to us a son is given; and the government shall be upon his shoulder, and his name shall be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.\n\nVerse 7\nOf the increase of his government and of peace there will be no end, on the throne of David and over his kingdom, to establish it and to uphold it with justice and with righteousness from this time forth and forevermore. The zeal of the LORD of hosts will do this."
      }
    ]
  },
  {
    "reference": "Isaiah 11:1-9",
    "minister": "Isaac Durosinuola",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 1: And there shall come forth a rod out of the stem of Jesse, and a Branch shall grow out of his roots:\nVerse 2: And the spirit of the LORD shall rest upon him, the spirit of wisdom and understanding, the spirit of counsel and might, the spirit of knowledge and of the fear of the LORD;\nVerse 3: And shall make him of quick understanding in the fear of the LORD: and he shall not judge after the sight of his eyes, neither reprove after the hearing of his ears:\nVerse 4: But with righteousness shall he judge the poor, and reprove with equity for the meek of the earth: and he shall smite the earth with the rod of his mouth, and with the breath of his lips shall he slay the wicked.\nVerse 5: And righteousness shall be the girdle of his loins, and faithfulness the girdle of his reins.\nVerse 6: The wolf also shall dwell with the lamb, and the leopard shall lie down with the kid; and the calf and the young lion and the fatling together; and a little child shall lead them.\nVerse 7: And the cow and the bear shall feed; their young ones shall lie down together: and the lion shall eat straw like the ox.\nVerse 8: And the sucking child shall play on the hole of the asp, and the weaned child shall put his hand on the cockatrice' den.\nVerse 9: They shall not hurt nor destroy in all my holy mountain: for the earth shall be full of the knowledge of the LORD, as the waters cover the sea."
      },
      {
        "name": "NIV",
        "text": "Verse 1\nA shoot will come up from the stump of Jesse; from his roots a Branch will bear fruit.\n\nVerse 2\nThe Spirit of the LORD will rest on him— the Spirit of wisdom and of understanding, the Spirit of counsel and of might, the Spirit of the knowledge and fear of the LORD—\n\nVerse 3\nand he will delight in the fear of the LORD. He will not judge by what he sees with his eyes, or decide by what he hears with his ears;\n\nVerse 4\nbut with righteousness he will judge the needy, with justice he will give decisions for the poor of the earth. He will strike the earth with the rod of his mouth; with the breath of his lips he will slay the wicked.\n\nVerse 5\nRighteousness will be his belt and faithfulness the sash around his waist.\n\nVerse 6\nThe wolf will live with the lamb, the leopard will lie down with the goat, the calf and the lion and the yearling together; and a little child will lead them.\n\nVerse 7\nThe cow will feed with the bear, their young will lie down together, and the lion will eat straw like the ox.\n\nVerse 8\nThe infant will play near the cobra’s den, and the young child will put its hand into the viper’s nest.\n\nVerse 9\nThey will neither harm nor destroy on all my holy mountain, for the earth will be filled with the knowledge of the LORD as the waters cover the sea."
      },
      {
        "name": "ESV",
        "text": "Verse 1\nThere shall come forth a shoot from the stump of Jesse, and a branch from his roots shall bear fruit.\n\nVerse 2\nAnd the Spirit of the LORD shall rest upon him, the Spirit of wisdom and understanding, the Spirit of counsel and might, the Spirit of knowledge and the fear of the LORD.\n\nVerse 3\nAnd his delight shall be in the fear of the LORD. He shall not judge by what his eyes see, or decide disputes by what his ears hear,\n\nVerse 4\nbut with righteousness he shall judge the poor, and decide with equity for the meek of the earth; and he shall strike the earth with the rod of his mouth, and with the breath of his lips he shall kill the wicked.\n\nVerse 5\nRighteousness shall be the belt of his waist, and faithfulness the belt of his loins.\n\nVerse 6\nThe wolf shall dwell with the lamb, and the leopard shall lie down with the young goat, and the calf and the lion and the fattened calf together; and a little child shall lead them.\n\nVerse 7\nThe cow and the bear shall graze; their young shall lie down together; and the lion shall eat straw like the ox.\n\nVerse 8\nThe nursing child shall play over the hole of the cobra, and the weaned child shall put his hand on the adder's den.\n\nVerse 9\nThey shall not hurt or destroy in all my holy mountain; for the earth shall be full of the knowledge of the LORD as the waters cover the sea."
      }
    ]
  },
  {
    "reference": "Luke 1:26-38",
    "minister": "Peter Bamigboye",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 26: And in the sixth month the angel Gabriel was sent from God unto a city of Galilee, named Nazareth.\nVerse 27: To a virgin espoused to a man whose name was Joseph, of the house of David; and the virgin's name was Mary.\nVerse 28: And the angel came in unto her, and said, Hail, thou that art highly favoured, the Lord is with thee: blessed art thou among women.\nVerse 29: And when she saw him, she was troubled at his saying, and cast in her mind what manner of salutation this should be.\nVerse 30: And the angel said unto her, Fear not, Mary: for thou hast found favour with God.\nVerse 31: And, behold, thou shalt conceive in thy womb, and bring forth a son, and shalt call his name JESUS.\nVerse 32: He shall be great, and shall be called the Son of the Highest: and the Lord God shall give unto him the throne of his father David.\nVerse 33: And he shall reign over the house of Jacob for ever; and of his kingdom there shall be no end.\nVerse 34: Then said Mary unto the angel, How shall this be, seeing I know not a man?\nVerse 35: And the angel answered and said unto her, The Holy Ghost shall come upon thee, and the power of the Highest shall overshadow thee: therefore also that holy thing which shall be born of thee shall be called the Son of God.\nVerse 36: And, behold, thy cousin Elisabeth, she hath also conceived a son in her old age: and this is the sixth month with her, who was called barren.\nVerse 37: For with God nothing shall be impossible.\nVerse 38: And Mary said, Behold the handmaid of the LORD; be it unto me according to thy word. And the angel departed from her."
      },
      {
        "name": "NIV",
        "text": "Verse 26: In the sixth month of Elizabeth’s pregnancy, God sent the angel Gabriel to Nazareth, a town in Galilee,\nVerse 27: to a virgin pledged to be married to a man named Joseph, a descendant of David. The virgin’s name was Mary.\nVerse 28: The angel went to her and said, “Greetings, you who are highly favored! The Lord is with you.”\nVerse 29: Mary was greatly troubled at his words and wondered what kind of greeting this might be.\nVerse 30: But the angel said to her, “Do not be afraid, Mary; you have found favor with God.\nVerse 31: You will conceive and give birth to a son, and you are to call him Jesus.\nVerse 32: He will be great and will be called the Son of the Most High. The Lord God will give him the throne of his father David,\nVerse 33: and he will reign over Jacob’s descendants forever; his kingdom will never end.”\nVerse 34: “How will this be,” Mary asked the angel, “since I am a virgin?”\nVerse 35: The angel answered, “The Holy Spirit will come on you, and the power of the Most High will overshadow you. So the holy one to be born will be called the Son of God.\nVerse 36: Even Elizabeth your relative is going to have a child in her old age, and she who was said to be unable to conceive is in her sixth month.\nVerse 37: For no word from God will ever fail.”\nVerse 38: “I am the Lord’s servant,” Mary answered. “May your word to me be fulfilled.” Then the angel left her."
      },
      {
        "name": "ESV",
        "text": "Verse 26: In the sixth month the angel Gabriel was sent from God to a city of Galilee named Nazareth,\nVerse 27: to a virgin betrothed to a man whose name was Joseph, of the house of David. And the virgin's name was Mary.\nVerse 28: And he came to her and said, “Greetings, O favored one, the Lord is with you!”\nVerse 29: But she was greatly troubled at the saying, and tried to discern what sort of greeting this might be.\nVerse 30: And the angel said to her, “Do not be afraid, Mary, for you have found favor with God.\nVerse 31: And behold, you will conceive in your womb and bear a son, and you shall call his name Jesus.\nVerse 32: He will be great and will be called the Son of the Most High. And the Lord God will give to him the throne of his father David,\nVerse 33: and he will reign over the house of Jacob forever, and of his kingdom there will be no end.”\nVerse 34: And Mary said to the angel, “How will this be, since I am a virgin?”\nVerse 35: And the angel answered her, “The Holy Spirit will come upon you, and the power of the Most High will overshadow you; therefore the child to be born will be called holy—the Son of God.\nVerse 36: And behold, your relative Elizabeth in her old age has also conceived a son, and this is the sixth month with her who was called barren.\nVerse 37: For nothing will be impossible with God.”\nVerse 38: And Mary said, “Behold, I am the servant of the Lord; let it be to me according to your word.” And the angel departed from her."
      }
    ]
  },
  {
    "reference": "Matthew 1:18-23",
    "minister": "Prophetess Omowumi Adekola",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 18: Now the birth of Jesus Christ was on this wise: when as his mother Mary was espoused to Joseph, before they came together, she was found with child of the Holy Ghost.\nVerse 19: Then Joseph her husband, being a just man, and not willing to make her a public example, was minded to put her away privily.\nVerse 20: But while he thought on these things, behold, the angel of the Lord appeared unto him in a dream, saying, Joseph, thou son of David, fear not to take unto thee Mary thy wife: for that which is conceived in her is of the Holy Ghost.\nVerse 21: And she shall bring forth a son, and thou shalt call his name JESUS: for he shall save his people from their sins.\nVerse 22: Now all this was done, that it might be fulfilled which was spoken of the Lord by the prophet, saying,\nVerse 23: Behold, a virgin shall be with child, and shall bring forth a son, and they shall call his name Emmanuel; which being interpreted is, God with us."
      },
      {
        "name": "NIV",
        "text": "Verse 18: This is how the birth of Jesus the Messiah came about: His mother Mary was pledged to be married to Joseph, but before they came together, she was found to be pregnant through the Holy Spirit.\nVerse 19: Because Joseph her husband was faithful to the law, and yet did not want to expose her to public disgrace, he had in mind to divorce her quietly.\nVerse 20: But after he had considered this, an angel of the Lord appeared to him in a dream and said, \"Joseph son of David, do not be afraid to take Mary home as your wife, because what is conceived in her is from the Holy Spirit.\nVerse 21: She will give birth to a son, and you are to give him the name Jesus, because he will save his people from their sins.\"\nVerse 22: All this took place to fulfill what the Lord had said through the prophet:\nVerse 23: \"The virgin will conceive and give birth to a son, and they will call him Immanuel\" (which means \"God with us\")."
      },
      {
        "name": "ESV",
        "text": "Verse 18: Jesus Christ’s birth occurred when Mary, pledged to Joseph, was found to be with child by the Holy Spirit before they came together.\nVerse 19: Joseph, being righteous and unwilling to shame her publicly, resolved to divorce her quietly.\nVerse 20: An angel appeared to Joseph in a dream, telling him not to fear taking Mary as his wife because the child was conceived by the Holy Spirit.\nVerse 21: Mary would bear a son named Jesus, who would save his people from their sins.\nVerse 22: These events fulfilled what the Lord spoke through the prophet.\nVerse 23: The virgin would conceive and bear a son called Immanuel, meaning God with us."
      }
    ]
  },
  {
    "reference": "Luke 8:8-16",
    "minister": "Evang. Deborah Adeoye",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 8: And other fell on good ground, and sprang up, and bare fruit an hundredfold. And when he had said these things, he cried, He that hath ears to hear, let him hear.\nVerse 9: And his disciples asked him, saying, What might this parable be?\nVerse 10: And he said, Unto you it is given to know the mysteries of the kingdom of God: but to others in parables; that seeing they might not see, and hearing they might not understand.\nVerse 11: Now the parable is this: The seed is the word of God.\nVerse 12: Those by the way side are they that hear; then cometh the devil, and taketh away the word out of their hearts, lest they should believe and be saved.\nVerse 13: They on the rock are they, which, when they hear, receive the word with joy; and these have no root, which for a while believe, and in time of temptation fall away.\nVerse 14: And that which fell among thorns are they, which, when they have heard, go forth, and are choked with cares and riches and pleasures of this life, and bring no fruit to perfection.\nVerse 15: But that on the good ground are they, which in an honest and good heart, having heard the word, keep it, and bring forth fruit with patience.\nVerse 16: No man, when he hath lighted a candle, covereth it with a vessel, or putteth it under a bed; but setteth it on a candlestick, that they which enter in may see the light."
      },
      {
        "name": "NIV",
        "text": "Verse 8: Some seed fell on good soil, producing a great harvest. Jesus called out that those who have ears should listen.\nVerse 9: His disciples asked him what the parable meant.\nVerse 10: Jesus explained that knowledge of God’s kingdom is given to his followers, while others hear only parables.\nVerse 11: He said the seed represents the word of God.\nVerse 12: Seed along the path represents those who hear, but the devil takes the word away so they will not believe.\nVerse 13: Seed on rocky ground represents those who receive the word with joy but fall away during testing.\nVerse 14: Seed among thorns represents those choked by life’s worries, riches, and pleasures.\nVerse 15: Seed on good soil represents those who hear, retain, and persevere, producing a crop.\nVerse 16: Jesus said no one lights a lamp and hides it; instead, it is placed so others can see the light."
      },
      {
        "name": "ESV",
        "text": "Verse 8: Some seed fell into good soil and grew, yielding a hundredfold. Jesus called out that anyone with ears should hear.\nVerse 9: His disciples asked him what the parable meant.\nVerse 10: Jesus said that the secrets of the kingdom of God are given to his followers, but others hear only parables so they may not perceive or understand.\nVerse 11: He explained that the seed represents the word of God.\nVerse 12: The seed along the path represents those who hear, but the devil removes the word from their hearts so they may not believe and be saved.\nVerse 13: The seed on the rock represents those who receive the word with joy but have no root and fall away when testing comes.\nVerse 14: The seed among thorns represents those who are choked by life’s cares, riches, and pleasures and do not mature.\nVerse 15: The seed in good soil represents those who hear the word, hold it fast in an honest and good heart, and bear fruit with patience.\nVerse 16: Jesus said no one lights a lamp and hides it, but places it on a stand so those who enter may see the light."
      }
    ]
  },
  {
    "reference": "Matthew 2:1-11",
    "minister": "Rev. Mother Ajaye",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 1: Now when Jesus was born in Bethlehem of Judaea in the days of Herod the king, behold, there came wise men from the east to Jerusalem,\nVerse 2: Saying, Where is he that is born King of the Jews? for we have seen his star in the east, and are come to worship him.\nVerse 3: When Herod the king had heard these things, he was troubled, and all Jerusalem with him.\nVerse 4: And when he had gathered all the chief priests and scribes of the people together, he demanded of them where Christ should be born.\nVerse 5: And they said unto him, In Bethlehem of Judaea: for thus it is written by the prophet,\nVerse 6: And thou Bethlehem, in the land of Juda, art not the least among the princes of Juda: for out of thee shall come a Governor, that shall rule my people Israel.\nVerse 7: Then Herod, when he had privily called the wise men, enquired of them diligently what time the star appeared.\nVerse 8: And he sent them to Bethlehem, and said, Go and search diligently for the young child; and when ye have found him, bring me word again, that I may come and worship him also.\nVerse 9: When they had heard the king, they departed; and, lo, the star, which they saw in the east, went before them, till it came and stood over where the young child was.\nVerse 10: When they saw the star, they rejoiced with exceeding great joy.\nVerse 11: And when they were come into the house, they saw the young child with Mary his mother, and fell down, and worshipped him: and when they had opened their treasures, they presented unto him gifts; gold, and frankincense, and myrrh."
      },
      {
        "name": "NIV",
        "text": "Verse 1: After Jesus was born in Bethlehem in Judea, during the time of King Herod, Magi from the east came to Jerusalem and asked,\nVerse 2: “Where is the one who has been born king of the Jews? We saw his star when it rose and have come to worship him.”\nVerse 3: When King Herod heard this he was disturbed, and all Jerusalem with him.\nVerse 4: When he had called together all the people’s chief priests and teachers of the law, he asked them where the Messiah was to be born.\nVerse 5: “In Bethlehem in Judea,” they replied, “for this is what the prophet has written:\nVerse 6: ‘But you, Bethlehem, in the land of Judah, are by no means least among the rulers of Judah; for out of you will come a ruler who will shepherd my people Israel.’”\nVerse 7: Then Herod called the Magi secretly and found out from them the exact time the star had appeared.\nVerse 8: He sent them to Bethlehem and said, “Go and search carefully for the child. As soon as you find him, report to me, so that I too may go and worship him.”\nVerse 9: After they had heard the king, they went on their way, and the star they had seen when it rose went ahead of them until it stopped over the place where the child was.\nVerse 10: When they saw the star, they were overjoyed.\nVerse 11: On coming to the house, they saw the child with his mother Mary, and they bowed down and worshiped him. Then they opened their treasures and presented him with gifts of gold, frankincense, and myrrh."
      },
      {
        "name": "ESV",
        "text": "Verse 1: Now after Jesus was born in Bethlehem of Judea in the days of Herod the king, behold, wise men from the east came to Jerusalem, saying,\nVerse 2: “Where is he who has been born king of the Jews? For we saw his star when it rose and have come to worship him.”\nVerse 3: When Herod the king heard this, he was troubled, and all Jerusalem with him;\nVerse 4: and assembling all the chief priests and scribes of the people, he inquired of them where the Christ was to be born.\nVerse 5: They told him, “In Bethlehem of Judea, for so it is written by the prophet:\nVerse 6: ‘And you, O Bethlehem, in the land of Judah, are by no means least among the rulers of Judah; for from you shall come a ruler who will shepherd my people Israel.’”\nVerse 7: Then Herod summoned the wise men secretly and ascertained from them what time the star had appeared.\nVerse 8: And he sent them to Bethlehem, saying, “Go and search diligently for the child, and when you have found him, bring me word, that I too may come and worship him.”\nVerse 9: After listening to the king, they went on their way. And behold, the star that they had seen when it rose went before them until it came to rest over the place where the child was.\nVerse 10: When they saw the star, they rejoiced exceedingly with great joy.\nVerse 11: And going into the house, they saw the child with Mary his mother, and they fell down and worshiped him. Then, opening their treasures, they offered him gifts, gold and frankincense and myrrh."
      }
    ]
  },
  {
    "reference": "John 1:1-14",
    "minister": "Apostle Ben Akanni",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 1: In the beginning was the Word, and the Word was with God, and the Word was God.\nVerse 2: The same was in the beginning with God.\nVerse 3: All things were made by him; and without him was not anything made that was made.\nVerse 4: In him was life; and the life was the light of men.\nVerse 5: And the light shineth in darkness; and the darkness comprehended it not.\nVerse 6: There was a man sent from God, whose name was John.\nVerse 7: The same came for a witness, to bear witness of the Light, that all men through him might believe.\nVerse 8: He was not that Light, but was sent to bear witness of that Light.\nVerse 9: That was the true Light, which lighteth every man that cometh into the world.\nVerse 10: He was in the world, and the world was made by him, and the world knew him not.\nVerse 11: He came unto his own, and his own received him not.\nVerse 12: But as many as received him, to them gave he power to become the sons of God, even to them that believe on his name:\nVerse 13: Which were born, not of blood, nor of the will of the flesh, nor of the will of man, but of God.\nVerse 14: And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth."
      },
      {
        "name": "NIV",
        "text": "Verse 1: In the beginning was the Word, and the Word was with God, and the Word was God.\nVerse 2: He was with God in the beginning.\nVerse 3: Through him all things were made; without him nothing was made that has been made.\nVerse 4: In him was life, and that life was the light of all mankind.\nVerse 5: The light shines in the darkness, and the darkness has not overcome it.\nVerse 6: There was a man sent from God whose name was John.\nVerse 7: He came as a witness to testify concerning that light, so that through him all might believe.\nVerse 8: He himself was not the light; he came only as a witness to the light.\nVerse 9: The true light that gives light to everyone was coming into the world.\nVerse 10: He was in the world, and though the world was made through him, the world did not recognize him.\nVerse 11: He came to that which was his own, but his own did not receive him.\nVerse 12: Yet to all who did receive him, to those who believed in his name, he gave the right to become children of God—\nVerse 13: children born not of natural descent, nor of human decision or a husband’s will, but born of God.\nVerse 14: The Word became flesh and made his dwelling among us. We have seen his glory, the glory of the one and only Son, who came from the Father, full of grace and truth."
      },
      {
        "name": "ESV",
        "text": "Verse 1: In the beginning was the Word, and the Word was with God, and the Word was God.\nVerse 2: He was in the beginning with God.\nVerse 3: All things were made through him, and without him was not any thing made that was made.\nVerse 4: In him was life, and the life was the light of men.\nVerse 5: The light shines in the darkness, and the darkness has not overcome it.\nVerse 6: There was a man sent from God, whose name was John.\nVerse 7: He came as a witness, to bear witness about the light, that all might believe through him.\nVerse 8: He was not the light, but came to bear witness about the light.\nVerse 9: The true light, which gives light to everyone, was coming into the world.\nVerse 10: He was in the world, and the world was made through him, yet the world did not know him.\nVerse 11: He came to his own, and his own people did not receive him.\nVerse 12: But to all who did receive him, who believed in his name, he gave the right to become children of God,\nVerse 13: who were born, not of blood nor of the will of the flesh nor of the will of man, but of God.\nVerse 14: And the Word became flesh and dwelt among us, and we have seen his glory, glory as of the only Son from the Father, full of grace and truth."
      }
    ]
  }
]
