[
  {
    "reference": "Genesis 3:8-15",
    "minister": "Odedeji B.J",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 8: And they heard the voice of the LORD God walking in the garden in the cool of the day: and Adam and his wife hid themselves from the presence of the LORD God among the trees of the garden.\nVerse 9: And the LORD God called unto Adam, and said unto him, Where art thou?\nVerse 10: And he said, I heard thy voice in the garden, and I was afraid, because I was naked; and I hid myself.\nVerse 11: And he said, Who told thee that thou wast naked? Hast thou eaten of the tree, whereof I commanded thee that thou shouldest not eat?\nVerse 12: And the man said, The woman whom thou gavest to be with me, she gave me of the tree, and I did eat.\nVerse 13: And the LORD God said unto the woman, What is this that thou hast done? And the woman said, The serpent beguiled me, and I ate.\nVerse 14: And the LORD God said unto the serpent, Because thou hast done this, thou art cursed above all cattle, and above every beast of the field; upon thy belly shalt thou go, and dust shalt thou eat all the days of thy life.\nVerse 15: And I will put enmity between thee and the woman, and between thy seed and her seed; it shall bruise thy head, and thou shalt bruise his heel."
      },
      {
        "name": "NIV",
        "text": "Verse 8: Then the man and his wife heard the sound of the LORD God as he was walking in the garden in the cool of the day, and they hid from the LORD God among the trees of the garden.\nVerse 9: But the LORD God called to the man, “Where are you?” \nVerse 10: He answered, “I heard you in the garden, and I was afraid because I was naked; so I hid.” \nVerse 11: And he said, “Who told you that you were naked? Have you eaten from the tree that I commanded you not to eat from?” \nVerse 12: The man said, “The woman you put here with me—she gave me some fruit from the tree, and I ate it.” \nVerse 13: Then the LORD God said to the woman, “What is this you have done?” The woman said, “The serpent deceived me, and I ate.” \nVerse 14: So the LORD God said to the serpent, “Because you have done this, cursed are you above all livestock and all wild animals! You will crawl on your belly and you will eat dust all the days of your life.\nVerse 15: And I will put enmity between you and the woman, and between your offspring and hers; he will crush your head, and you will strike his heel.” "
      },
      {
        "name": "ESV",
        "text":"Verse 8: And they heard the sound of the LORD God walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of the LORD God among the trees of the garden.\nVerse 9: But the LORD God called to the man and said to him, 'Where are you?'\nVerse 10: And he said, 'I heard the sound of you in the garden, and I was afraid, because I was naked, and I hid myself.'\nVerse 11: He said, 'Who told you that you were naked? Have you eaten of the tree of which I commanded you not to eat?'\nVerse 12: The man said, 'The woman whom you gave to be with me, she gave me fruit of the tree, and I ate.'\nVerse 13: Then the LORD God said to the woman, 'What is this that you have done?' The woman said, 'The serpent deceived me, and I ate.'\nVerse 14: The LORD God said to the serpent, 'Because you have done this, cursed are you above all livestock and above all beasts of the field; on your belly you shall go, and dust you shall eat all the days of your life.'\nVerse 15: I will put enmity between you and the woman, and between your offspring and her offspring; he shall bruise your head, and you shall bruise his heel.'"
      }
    ]
  },
  {
    "reference": "Genesis 22:15-18",
    "minister": "Ifeoluwa Odedeji",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 15: And the angel of the LORD called unto Abraham out of heaven the second time, and said, By myself have I sworn, saith the LORD, for because thou hast done this thing, and hast not withheld thy son, thine only son:\nVerse 16: That in blessing I will bless thee, and in multiplying I will multiply thy seed as the stars of the heaven, and as the sand which is upon the sea shore; and thy seed shall possess the gate of his enemies;\nVerse 17: And in thy seed shall all the nations of the earth be blessed; because thou hast obeyed my voice.\nVerse 18: For I have known him, that he will command his children and his household after him, and they shall keep the way of the LORD, to do justice and judgment; that the LORD may bring upon Abraham that which he hath spoken of him."
      },
      {
        "name": "NIV",
        "text":"Verse 15: The angel of the LORD called to Abraham from heaven a second time\nVerse 16: and said, “I swear by myself, declares the LORD, that because you have done this and have not withheld your son, your only son,\nVerse 17: I will surely bless you and make your descendants as numerous as the stars in the sky and as the sand on the seashore. Your descendants will take possession of the cities of their enemies,\nVerse 18: and through your offspring all nations on earth will be blessed, because you have obeyed me.”"
      },
      {
        "name": "ESV",
        "text": "Verse 15: And the angel of the LORD called to Abraham a second time from heaven\nVerse 16: and said, “By myself I have sworn, declares the LORD, because you have done this and have not withheld your son, your only son,\nVerse 17: I will surely bless you, and I will surely multiply your offspring as the stars of heaven and as the sand that is on the seashore. And your offspring shall possess the gate of his enemies,\nVerse 18: and in your offspring shall all the nations of the earth be blessed, because you have obeyed my voice.”"
    }
  ]
},
  {
    "reference": "Isaiah 9:2,6-7",
    "minister": "Odedeji O.A (JP)",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 2: The people that walked in darkness have seen a great light: they that dwell in the land of the shadow of death, upon them hath the light shined.\nVerse 6: For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.\nVerse 7: Of the increase of his government and peace there shall be no end, upon the throne of David, and upon his kingdom, to order it, and to establish it with judgment and with justice from henceforth even for ever. The zeal of the LORD of hosts will perform this."
      },
      {
        "name": "NIV",
        "text": "Verse 2: The people walking in darkness have seen a great light; on those living in the land of deep darkness a light has dawned.\nVerse 6: For to us a child is born, to us a son is given, and the government will be on his shoulders. And he will be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.\nVerse 7: Of the greatness of his government and peace there will be no end. He will reign on David’s throne and over his kingdom, establishing and upholding it with justice and righteousness from that time on and forever. The zeal of the LORD Almighty will accomplish this."
      },
      {
        "name": "ESV",
        "text": "[ESV text here]"
      }
    ]
  },
  {
    "reference": "Isaiah 11:1-9",
    "minister": "Isaac Durosinuola",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 1: And there shall come forth a rod out of the stem of Jesse, and a Branch shall grow out of his roots:\nVerse 2: And the spirit of the LORD shall rest upon him, the spirit of wisdom and understanding, the spirit of counsel and might, the spirit of knowledge and of the fear of the LORD;\nVerse 3: And shall make him of quick understanding in the fear of the LORD: and he shall not judge after the sight of his eyes, neither reprove after the hearing of his ears:\nVerse 4: But with righteousness shall he judge the poor, and reprove with equity for the meek of the earth: and he shall smite the earth with the rod of his mouth, and with the breath of his lips shall he slay the wicked.\nVerse 5: And righteousness shall be the girdle of his loins, and faithfulness the girdle of his reins.\nVerse 6: The wolf also shall dwell with the lamb, and the leopard shall lie down with the kid; and the calf and the young lion and the fatling together; and a little child shall lead them.\nVerse 7: And the cow and the bear shall feed; their young ones shall lie down together: and the lion shall eat straw like the ox.\nVerse 8: And the sucking child shall play on the hole of the asp, and the weaned child shall put his hand on the cockatrice' den.\nVerse 9: They shall not hurt nor destroy in all my holy mountain: for the earth shall be full of the knowledge of the LORD, as the waters cover the sea."
      },
      {
        "name": "NIV",
        "text": "[NIV text here]"
      },
      {
        "name": "ESV",
        "text": "[ESV text here]"
      }
    ]
  },
  {
    "reference": "Luke 1:26-38",
    "minister": "Peter Bamigboye",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 26: And in the sixth month the angel Gabriel was sent from God unto a city of Galilee, named Nazareth.\nVerse 27: To a virgin espoused to a man whose name was Joseph, of the house of David; and the virgin's name was Mary.\nVerse 28: And the angel came in unto her, and said, Hail, thou that art highly favoured, the Lord is with thee: blessed art thou among women.\nVerse 29: And when she saw him, she was troubled at his saying, and cast in her mind what manner of salutation this should be.\nVerse 30: And the angel said unto her, Fear not, Mary: for thou hast found favour with God.\nVerse 31: And, behold, thou shalt conceive in thy womb, and bring forth a son, and shalt call his name JESUS.\nVerse 32: He shall be great, and shall be called the Son of the Highest: and the Lord God shall give unto him the throne of his father David.\nVerse 33: And he shall reign over the house of Jacob for ever; and of his kingdom there shall be no end.\nVerse 34: Then said Mary unto the angel, How shall this be, seeing I know not a man?\nVerse 35: And the angel answered and said unto her, The Holy Ghost shall come upon thee, and the power of the Highest shall overshadow thee: therefore also that holy thing which shall be born of thee shall be called the Son of God.\nVerse 36: And, behold, thy cousin Elisabeth, she hath also conceived a son in her old age: and this is the sixth month with her, who was called barren.\nVerse 37: For with God nothing shall be impossible.\nVerse 38: And Mary said, Behold the handmaid of the LORD; be it unto me according to thy word. And the angel departed from her."
      },
      {
        "name": "NIV",
        "text": "[NIV text here]"
      },
      {
        "name": "ESV",
        "text": "[ESV text here]"
      }
    ]
  },
  {
    "reference": "Matthew 1:18-23",
    "minister": "Prophetess Omowumi Adekola",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 18: Now the birth of Jesus Christ was on this wise: when as his mother Mary was espoused to Joseph, before they came together, she was found with child of the Holy Ghost.\nVerse 19: Then Joseph her husband, being a just man, and not willing to make her a public example, was minded to put her away privily.\nVerse 20: But while he thought on these things, behold, the angel of the Lord appeared unto him in a dream, saying, Joseph, thou son of David, fear not to take unto thee Mary thy wife: for that which is conceived in her is of the Holy Ghost.\nVerse 21: And she shall bring forth a son, and thou shalt call his name JESUS: for he shall save his people from their sins.\nVerse 22: Now all this was done, that it might be fulfilled which was spoken of the Lord by the prophet, saying,\nVerse 23: Behold, a virgin shall be with child, and shall bring forth a son, and they shall call his name Emmanuel; which being interpreted is, God with us."
      },
      {
        "name": "NIV",
        "text": "[NIV text here]"
      },
      {
        "name": "ESV",
        "text": "[ESV text here]"
      }
    ]
  },
  {
    "reference": "Luke 8:8-16",
    "minister": "Evang. Deborah Adeoye",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 8: ¶ ...\nVerse 9: ¶ ...\nVerse 10: ¶ ...\nVerse 11: ¶ ...\nVerse 12: ¶ ...\nVerse 13: ¶ ...\nVerse 14: ¶ ...\nVerse 15: ¶ ...\nVerse 16: ¶ ..."
      },
      {
        "name": "NIV",
        "text": "[NIV text here]"
      },
      {
        "name": "ESV",
        "text": "[ESV text here]"
      }
    ]
  },
  {
    "reference": "Matthew 2:1-11",
    "minister": "Rev. Mother Ajaye",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 1: ¶ ...\nVerse 2: ¶ ...\nVerse 3: ¶ ...\nVerse 4: ¶ ...\nVerse 5: ¶ ...\nVerse 6: ¶ ...\nVerse 7: ¶ ...\nVerse 8: ¶ ...\nVerse 9: ¶ ...\nVerse 10: ¶ ...\nVerse 11: ¶ ..."
      },
      {
        "name": "NIV",
        "text": "[NIV text here]"
      },
      {
        "name": "ESV",
        "text": "[ESV text here]"
      }
    ]
  },
  {
    "reference": "John 1:1-14",
    "minister": "Apostle Ben Akanni",
    "versions": [
      {
        "name": "KJV",
        "text": "Verse 1: In the beginning was the Word, and the Word was with God, and the Word was God.\nVerse 2: The same was in the beginning with God.\nVerse 3: All things were made by him; and without him was not anything made that was made.\nVerse 4: In him was life; and the life was the light of men.\nVerse 5: And the light shineth in darkness; and the darkness comprehended it not.\nVerse 6: There was a man sent from God, whose name was John.\nVerse 7: The same came for a witness, to bear witness of the Light, that all men through him might believe.\nVerse 8: He was not that Light, but was sent to bear witness of that Light.\nVerse 9: That was the true Light, which lighteth every man that cometh into the world.\nVerse 10: He was in the world, and the world was made by him, and the world knew him not.\nVerse 11: He came unto his own, and his own received him not.\nVerse 12: But as many as received him, to them gave he power to become the sons of God, even to them that believe on his name:\nVerse 13: Which were born, not of blood, nor of the will of the flesh, nor of the will of man, but of God.\nVerse 14: And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth."
      },
      {
        "name": "NIV",
        "text": "[NIV text here]"
      },
      {
        "name": "ESV",
        "text": "[ESV text here]"
      }
    ]
  }
]
